app/controllers/applicants_controller.rb

   def create
    @user = User.create(user_params)
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('liyunhui', '$2a$12$LoqXqFXg1zb5uvMhU.zpUOKOKNfcMLQPsw9i83HpqSAK51SlF6tXe', '2020-01-14 15:26:47.352449', '2020-01-14 15:26:47.352449')