class InfopageController < ApplicationController
    def info 
        @sexdict = Hash["男士"=>"1","女士"=>"2"]
        @salarydict = Hash["3000元以下"=>"1",
        "3001-5000元"=>"2","5001-8000元"=>"3",
        "8001-12000元"=>"4","12001-20000元"=>"5",
        "20001-50000元"=>"6","50000以上"=>"7"]
        @statusdict = Hash["未婚"=>"0",
               "离异"=>"1",
               "丧偶"=>"2"]
        @educationdict = Hash["高中及以下"=>"0",
        "中专"=>"1",
        "大专"=>"2",
        "大学本科"=>"3",
        "硕士"=>"4",
        "博士"=>"5"]

        @shapedict = Hash[
            "体型:一般"=>"0",
            "体型:瘦长"=>"1",
            "体型:苗条"=>"2",
            "体型:高大美丽"=>"3",
            "体型:丰满"=>"4",
            "体型:富线条美"=>"5",
            "体型:运动员型"=>"6",
            "体型:比较胖"=>"7",
            "体型:体格魁梧"=>"8",
            "体型:壮实"=>"9",
            "体型:保密"=>"10",]

        @zodiacdict = Hash["水瓶座(01.20-02.19)"=>"1",
        "双鱼座(02.20-03.20)"=>"2",
        "牡羊座(03.21-04.20)"=>"3",
        "金牛座(04.21-05.20)"=>"4",
        "双子座(05.21-06.21)"=>"5",
        "巨蟹座(06.22-07.22)"=>"6",
        "狮子座(07.23-08.22)"=>"7",
        "处女座(08.23-09.22)"=>"8",
        "天秤座(09.23-10.22)"=>"9",
        "天蝎座(10.23-11.21)"=>"10",
        "射手座(11.22-12.21)"=>"11",
        "魔羯座(12.22-01.19)"=>"12",]

        @hasChilddict = Hash[
            "没有小孩"=>"1",
        "有孩子且住在一起"=>"2",
        "有孩子且偶尔会一起住"=>"3",
        "有孩子但不在身边"=>"4"
        ]
        @wantChilddict = Hash[
            "是否想要孩子:视情况而定"=>"1",
            "是否想要孩子:想要孩子"=>"2",
            "是否想要孩子:不想要孩子"=>"3",
            "是否想要孩子:以后再告诉你"=>"4"
        ]

        @marriageTimedict = Hash[
            "何时结婚:认同闪婚"=>"1",
            "何时结婚:一年内"=>"2",
            "何时结婚:两年内"=>"3",
            "何时结婚:三年内"=>"4",
            "何时结婚:时机成熟就结婚"=>"5"

        ]
            
        @housedict = Hash[
            "和家人同住"=>"1",
            "已购房"=>"2",
            "租房"=>"3",
            "打算婚后购房"=>"4",
            "住在单位宿舍"=>"5",
        ]

        @cardict = Hash[
            "已买车"=>"1",
            "未买车"=>"2"
        ]

        @smokedict = Hash[
            "不吸烟 "=>"1",
            "稍微抽一点烟"=>"2",
            "烟抽得很多"=>"3",
            "社交场合会抽烟"=>"4",
        ]

        @drinkdict = Hash[
            "不喝酒": "1",
            "稍微喝一点酒 ": "2",
            "酒喝得很多": "3",
            "社交场合会喝酒": "4"
        ]

        iid = params[:id]
        @basicInfo = BasicInfo.find_by(id:iid)
        @favor = Favorite.find_by(id:iid)
        @recomd = Recomd.find_by(id:iid)
        @alalyze = Analysis.find_by(id:iid)
        rc1 = @recomd.rc1.to_i.to_s
        rc2 = @recomd.rc2.to_i.to_s
        rc3 = @recomd.rc3.to_i.to_s
        rc4 = @recomd.rc4.to_i.to_s
        rc5 = @recomd.rc5.to_i.to_s
        @rc1 = BasicInfo.find_by(id:rc1)
        @rc2 = BasicInfo.find_by(id:rc2)
        @rc3 = BasicInfo.find_by(id:rc3)
        @rc4 = BasicInfo.find_by(id:rc4)
        @rc5 = BasicInfo.find_by(id:rc5)
    end
end
