app/controllers/infopage_controller.rb

SELECT `recomd`.* FROM `recomd` WHERE `recomd`.`id` = 1677727158.0 LIMIT 1
---
        iid = params[:id]
        @basicInfo = BasicInfo.find_by(id:iid)
        @favor = Favorite.find_by(id:iid)
        @recomd = Recomd.find_by(id:iid)