app/controllers/infopage_controller.rb

    def info
        iid = params[:id]
        @basicInfo = BasicInfo.find_by(id:iid)
        @favor = Favorite.find_by(id:iid)
        @recomd = Recomd.find_by(id:iid)
---
SELECT `recomd`.* FROM `recomd` WHERE `recomd`.`id` = 1000383499.0 LIMIT 1