app/controllers/sessions_controller.rb

  def create
   user = User.find_by(name: user_params[:name]).try(:authenticate, user_params[:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'liyunhui' LIMIT 1